#include <iostream>

using namespace std;
// 缺省参数
// 缺省参数是声明或定义函数时为函数的参数指定一个缺省值。在调用该函数时，如果没有指定实
// 参则采用该形参的缺省值，否则使用指定的实参。

// 没有传参时，使用参数的默认值
// 传参时，使用指定的实参

// 缺省参数分类
// 1.全缺省参数
void Func(int a = 10, int b = 20, int c = 30)
{
    cout << "a = " << a << endl;
    cout << "b = " << b << endl;
    cout << "c = " << c << endl;
}
// 2.半缺省参数
void Func(int a, int b = 10, int c = 20)
{
    cout << "a = " << a << endl;
    cout << "b = " << b << endl;
    cout << "c = " << c << endl;
}

// 注意：
// 1. 半缺省参数必须从右往左依次来给出，不能间隔着给
// 2. 缺省参数不能在函数声明和定义中同时出现
// 3. 缺省值必须是常量或者全局变量
// 4. C语言不支持（编译器不支持）